InformationRegisters/КИИ_НазначенияЭкспертов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КИИ_НазначенияЭкспертов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_ЭкспертыИИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КИИ_НазначенияЭкспертов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КИИ_ЭкспертыИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_ЭкспертыИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_МоделиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПовторныхЗапросов</Name>
					<Comment>Максимум повторов к модели при ошибках, исправимых повторной генерацией</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогУверенностиКандидата</Name>
					<Comment>Минимальное значение confidence кандидата для автозаполнения расшифровки (0..1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_СхемыОтветаИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КИИ_ЭкспертыИИ/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на схему ответа, привязанную к эксперту ИИ.
//
// Параметры:
//  Эксперт - СправочникСсылка.КИИ_ЭкспертыИИ
//
// Возвращаемое значение:
//  СправочникСсылка.КИИ_СхемыОтветаИИ
//
Функция ПолучитьСхемуОтветаЭксперта(Эксперт) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "СхемаОтвета");

КонецФункции

// Возвращает лимит повторных запросов к модели для эксперта.
// При нулевом или незаполненном значении в метаданных используется значение по умолчанию 3.
//
// Параметры:
//  Эксперт - СправочникСсылка.КИИ_ЭкспертыИИ
//
// Возвращаемое значение:
//  Число
//
Функция ЛимитПовторныхЗапросовЭксперта(Эксперт) Экспорт

	Лимит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "ЛимитПовторныхЗапросов");

	Если Не ЗначениеЗаполнено(Лимит) Или Лимит <= 0 Тогда
		Возврат 3;
	КонецЕсли;

	Возврат Лимит;

КонецФункции

// Возвращает минимально допустимую уверенность модели (confidence) для автозаполнения кандидата.
// При пустом или некорректном значении в метаданных используется значение по умолчанию 0,7.
//
// Параметры:
//  Эксперт - СправочникСсылка.КИИ_ЭкспертыИИ
//
// Возвращаемое значение:
//  Число - от 0 до 1
//
Функция ПорогУверенностиКандидата(Эксперт) Экспорт

	Порог = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "ПорогУверенностиКандидата");

	Если Не ЗначениеЗаполнено(Порог) Или Порог <= 0 Или Порог > 1 Тогда
		Возврат ПорогУверенностиКандидатаПоУмолчанию();
	КонецЕсли;

	Возврат Порог;

КонецФункции

// Формирует JSON Schema по данным метаданных схемы ответа.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Структура - JSON Schema корневого объекта
//
Функция СформироватьJsonSchema(СхемаОтвета) Экспорт

	Возврат Справочники.КИИ_СхемыОтветаИИ.СформироватьJsonSchema(СхемаОтвета);

КонецФункции

// Формирует структуру response_format для AI Studio (json_schema).
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Структура - response_format с полями type, json_schema
//
Функция СформироватьResponseFormat(СхемаОтвета) Экспорт

	Возврат Справочники.КИИ_СхемыОтветаИИ.СформироватьResponseFormat(СхемаОтвета);

КонецФункции

// Возвращает текст блока «Формат ответа (строго)» с JSON Schema для добавления в промпт.
// Если у эксперта не указана схема ответа — пустая строка.
//
// Параметры:
//  Эксперт - СправочникСсылка.КИИ_ЭкспертыИИ
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстФорматаОтветаДляПромпта(Эксперт) Экспорт

	СхемаОтвета = ПолучитьСхемуОтветаЭксперта(Эксперт);

	Если Не ЗначениеЗаполнено(СхемаОтвета) Тогда
		Возврат "";
	КонецЕсли;

	JsonSchema = СформироватьJsonSchema(СхемаОтвета);
	ТекстСхемы = ОбщегоНазначения.ЗначениеВJSON(JsonSchema);

	Возврат НСтр("ru = 'Формат ответа (строго):'") + Символы.ПС + ТекстСхемы;

КонецФункции

// Возвращает ссылку на валидатор всего ответа модели по схеме.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  СправочникСсылка.КИИ_ВалидаторыОтветаИИ
//
Функция ВалидаторОтветаСхемы(СхемаОтвета) Экспорт

	Возврат Справочники.КИИ_СхемыОтветаИИ.ВалидаторОтвета(СхемаОтвета);

КонецФункции

// Возвращает доверенный код валидации всего ответа модели по схеме.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Строка
//
Функция КодВалидацииОтветаСхемы(СхемаОтвета) Экспорт

	Возврат Справочники.КИИ_СхемыОтветаИИ.КодВалидацииОтвета(СхемаОтвета);

КонецФункции

// Возвращает описания полей с доверенным кодом валидации.
// Код валидации не включается в JSON Schema для модели.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Массив из Структура - см. Справочники.КИИ_СхемыОтветаИИ.ПолучитьВалидаторыПолей
//
Функция ПолучитьВалидаторыПолейСхемы(СхемаОтвета) Экспорт

	Возврат Справочники.КИИ_СхемыОтветаИИ.ПолучитьВалидаторыПолей(СхемаОтвета);

КонецФункции

// Проверяет JSON-ответ модели по схеме и валидаторам 1С.
//
// Параметры:
//  Эксперт - СправочникСсылка.КИИ_ЭкспертыИИ
//  ТекстОтветаJSON - Строка
//  КонтекстПроверки - Структура - произвольный контекст для валидаторов (необязательно)
//  КоличествоВыполненныхПовторов - Число - сколько повторов уже выполнено до текущей попытки
//
// Возвращаемое значение:
//  Структура - см. КИИ_ВалидацияОтветаИИ.НовыйИтогВалидации
//
Функция ПроверитьОтветПоСхеме(Эксперт, ТекстОтветаJSON, КонтекстПроверки = Неопределено, КоличествоВыполненныхПовторов = 0) Экспорт

	СхемаОтвета = ПолучитьСхемуОтветаЭксперта(Эксперт);
	Модель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "Модель");

	Если Не ЗначениеЗаполнено(СхемаОтвета) Тогда
		ВызватьИсключение НСтр("ru = 'У эксперта ИИ не указана схема ответа.'");
	КонецЕсли;

	Итог = КИИ_ВалидацияОтветаИИ.ПроверитьОтветПоСхеме(СхемаОтвета, Модель, ТекстОтветаJSON, КонтекстПроверки);
	ЛимитПовторов = ЛимитПовторныхЗапросовЭксперта(Эксперт);

	Возврат КИИ_ВалидацияОтветаИИ.ПрименитьЛимитПовторныхЗапросов(Итог, ЛимитПовторов, КоличествоВыполненныхПовторов);

КонецФункции

// Возвращает эксперта ИИ, сопоставленного с назначением в регистре сведений КИИ_НазначенияЭкспертов.
//
// Параметры:
//  Назначение - ПланВидовХарактеристикСсылка.КИИ_НазначенияЭкспертов
//
// Возвращаемое значение:
//  СправочникСсылка.КИИ_ЭкспертыИИ
//
Функция ЭкспертПоНазначению(Назначение) Экспорт

	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат Справочники.КИИ_ЭкспертыИИ.ПустаяСсылка();
	КонецЕсли;

	Отбор = Новый Структура("Назначение", Назначение);
	Запись = РегистрыСведений.КИИ_НазначенияЭкспертов.Получить(Отбор);

	Возврат Запись.Эксперт;

КонецФункции

// Проверяет, что для назначения настроен непустой эксперт ИИ.
//
// Параметры:
//  Назначение - ПланВидовХарактеристикСсылка.КИИ_НазначенияЭкспертов
//
// Возвращаемое значение:
//  Структура - Эксперт, ЭтоОшибка, ТекстОшибки
//
Функция ПроверитьНаличиеЭкспертаДляНазначения(Назначение) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Эксперт", Справочники.КИИ_ЭкспертыИИ.ПустаяСсылка());
	Результат.Вставить("ЭтоОшибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");

	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Результат.ЭтоОшибка = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Назначение эксперта ИИ не задано.'");
		Возврат Результат;
	КонецЕсли;

	Эксперт = ЭкспертПоНазначению(Назначение);

	Если Не ЗначениеЗаполнено(Эксперт) Тогда
		Результат.ЭтоОшибка = Истина;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Для назначения ""%1"" не настроен эксперт ИИ. Заполните запись в регистре сведений ""Эксперты ИИ по назначениям"".'"),
			Назначение);
		Возврат Результат;
	КонецЕсли;

	Результат.Эксперт = Эксперт;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПорогУверенностиКандидатаПоУмолчанию()

	Возврат 0.7;

КонецФункции

#КонецОбласти

#КонецЕсли
